newwms_gift/src/Catalogs/ВидыДополнительныхРабот/ВидыДополнительныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДополнительныхРабот</name>
  <attributes>
    <name>ШаблонКомментария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыШаблона</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

newwms_gift/src/Catalogs/ВидыДополнительныхРабот/Forms/ФормаУстановкиПараметров/Module.bsl
&НаСервере
Процедура ЗадатьПараметрыНаФорме()
	ДобавляемыеРеквизиты=новый Массив;
	Для Каждого стр из Параметры.Ссылка.ПараметрыШаблона цикл
		Реквизит = Новый РеквизитФормы(СтрЗаменить(стр.ИмяПараметра," ",""),ОпределеитьОписаниеТипа(стр.ТипЗначения),,стр.ИмяПараметра,Ложь);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Для Каждого стр из Параметры.Ссылка.ПараметрыШаблона цикл
		Элементы.Добавить(Элементы.ГруппаПараметров.Имя+СтрЗаменить(стр.ИмяПараметра," ",""),Тип("ПолеФормы"),Элементы.ГруппаПараметров);
		Элементы[Элементы.ГруппаПараметров.Имя+СтрЗаменить(стр.ИмяПараметра," ","")].ПутьКДанным=СтрЗаменить(стр.ИмяПараметра," ","");
		Элементы[Элементы.ГруппаПараметров.Имя+СтрЗаменить(стр.ИмяПараметра," ","")].Вид=ВидПоляФормы.ПолеВвода;
	КонецЦикла;
КонецПроцедуры
&НаСервере
Функция ОпределеитьОписаниеТипа(Типы)
	МассивТипов=новый Массив;
	Если ТипЗнч(Типы)<>Тип("Массив") Тогда 
		МассивТипов.Добавить(Типы);
	иначе
		МассивТипов=Типы;
	КонецЕсли;
	СтрокаТипов="";
	Для Каждого стр из МассивТипов цикл
		Если СтрокаТипов="" Тогда 
			СтрокаТипов=СтрокаТипов+стр;
		иначе
			СтрокаТипов=СтрокаТипов+","+стр;
		КонецЕсли;	
	КонецЦикла;
	Возврат новый ОписаниеТипов(СтрокаТипов,,,новый КвалификаторыЧисла(15,3),новый КвалификаторыСтроки(255),новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));		
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗадатьПараметрыНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	МассивСтруктурированныхДанных=ПолучитьДанныеПараметров();
	ВычислитьДанные();
	СтруктураОтвета=новый Структура;
	СтруктураОтвета.Вставить("МассивСтруктурированныхДанных",МассивСтруктурированныхДанных);
	СтруктураОтвета.Вставить("НачисленоФакт",НачисленоФакт);
	ОповеститьОВыборе(СтруктураОтвета);
КонецПроцедуры
&НаСервере	
Процедура ВычислитьДанные()
	СтрокаФормулы=Параметры.Ссылка.ФормулаШаблона;
	Для Каждого стр из   Параметры.Ссылка.ПараметрыШаблона Цикл 
		СтрокаФормулы=СтрЗаменить(СтрокаФормулы,стр.ИмяПараметра,"ЭтаФорма."+стр.ИмяПараметра);
	КонецЦикла;
	
	НачисленоФакт=Вычислить(СтрокаФормулы);
КонецПроцедуры

&НаСервере	
Функция  ПолучитьДанныеПараметров()
	РеквизитыФормы=ПолучитьРеквизиты();
	МассивДанных=новый Массив;
	Для Каждого Рек из РеквизитыФормы цикл
		СтруктураДанных=новый Структура;
		СтруктураДанных.Вставить("Имя",Рек.Имя);
		СтруктураДанных.Вставить("Значение",ЭтаФорма[Рек.Имя]);
		МассивДанных.Добавить(СтруктураДанных);
	КонецЦикла;
	Возврат МассивДанных;
КонецФункции
